Repository: phlenfyl/officialcam
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: English
fr: Anglais

source: French
fr: Français

source: name
fr: nom

source: time
fr: temps

source: To be displayed at program page
fr: À afficher sur la page du programme

source: created
fr: créé

source: updated
fr: mis à jour

source: Week Service
fr: Service de la semaine

source: fullame
fr: nom complet

source: number
fr: numéro

source: ip address
fr: addresse ip

source: title
fr: titre

source: desc
fr: description

source: video
fr: vidéo

source: like_count
fr: nombre de likes

source: specialprogram
fr: programme spécial

source: deliverance
fr: délivrance

source: counseling
fr: conseils

source: display
fr: affichage

source: Program
fr: Programme

source: ProgramNum
fr: Compt du programme

source: Author
fr: Auteur

source: SURELY THE LORD IS HERE
fr: CERTAINEMENT LE SEIGNEUR EST ICI

source: MFM Ministries is a full gospel ministry
fr: MFM Ministries est un ministère évangélique complet

source: devoted <br /> to the Revival of
fr: dévoué <br /> au renouveau de

source: Apostolic Signs, Holy Ghost <br />
fr: Signes apostoliques, Saint-Esprit <br />

source: fireworks and the unlimited demonstration
fr: feux d'artifice et démonstration illimitée

source: of the <br /> power of God
fr: du <br /> pouvoir de Dieu

source: to deliver to the uttermost.
fr: pour livrer au maximum.

source: MFM Cameroon
fr: Mfm Cameroun

source: Available Books
fr: Livres disponibles

source: Our Program
fr: Notre Programme

source: Programs
fr: Programmes

source: Home
fr: Accueil

source: Who we are?
fr: Qui Somes-nous ?

source: MFM Ministries is a full gospel ministry <br />
fr: MFM Ministries est un ministère évangélique complet <br />

source: devoted to the Revival of Apostolic Signs,<br />
fr: dévoué au renouveau des signes apostoliques, <br />

source: Holy Ghost fireworks and the unlimited <br />
fr: feux d'artifice du Saint-Esprit et la démonstration illimitée <br />

source: demonstration of the power of God to <br />
fr: du pouvoir de Dieu pour <br />

source: deliver to the uttermost.
fr: livrer au maximum.

source: Read More
fr: Lire la suite

source: Join us for our special programs
fr: Rejoignez-nous pour nos programmes spéciaux

source: More Programs
fr: Plus de programmes

source: Listen to our Messages
fr: Écoutez nos messages

source: Listen and Download Messages
fr: Écoutez et téléchargez des messages

source: Your browser does not support the audio element
fr: Votre navigateur ne prend pas en charge l'élément audio

source: Download
fr: Télécharger

source: More Sermons
fr: Plus de sermons

source: Join us for our Mid-Week Programs
fr: Rejoignez-nous pour nos programmes de mi-semaine

source: View All
fr: Voir tout

source: Get in touch and let's know how we can help
fr: Prenez contact et dites-nous comment nous pouvons aider

source: Need Help? <br /> Messages Us
fr: Besoin d'aide ? <br /> Contactez-nous

source: Have a need or enquiry? <br /> Reach out to us Here <br /> by filling the form below
fr: Vous avez un besoin ou une demande ? <br /> Contactez-nous ici <br /> en remplissant le formulaire ci-dessous

source: Full Name
fr: Nom complet

source: Phone Number
fr: Numero de telephone

source: Email Address
fr: Addresse email

source: Your Message
fr: Votre Message

source: Send Message
fr: Envoyer le message

source: Our Mission and Vision
fr: Notre mission et notre vision

source: Join us for <br /> special programs
fr: Rejoignez-nous pour <br /> des programmes spéciaux

source: Listen to our programs
fr: Écoutez nos programmes

source: Weekly Services
fr: Services hebdomadaires

source: Counseling Services
fr: Services de conseil

source: Deliverance Programs
fr: Programmes de délivrance

source: Special Programs
fr: Programmes spéciaux

source: Listen to our <br /> Messages
fr: Écoutez nos <br /> messages
